# relatorio de analise 4

## selecoes e frequencias

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep = ';')

In [3]:
#Selecione somente os imóveis classificados com tipo 'Apartamento'.

selecao = dados['Tipo'] == 'Apartamento'

In [4]:
selecao

0        False
1        False
2         True
3         True
4         True
5         True
6        False
7        False
8         True
9         True
10        True
11        True
12       False
13        True
14       False
15        True
16        True
17        True
18       False
19        True
20        True
21        True
22        True
23        True
24       False
25        True
26        True
27        True
28        True
29        True
         ...
22550     True
22551     True
22552     True
22553     True
22554     True
22555    False
22556     True
22557     True
22558    False
22559     True
22560     True
22561     True
22562     True
22563     True
22564     True
22565     True
22566     True
22567     True
22568     True
22569    False
22570     True
22571     True
22572     True
22573     True
22574    False
22575     True
22576    False
22577     True
22578     True
22579     True
Name: Tipo, Length: 22580, dtype: bool

In [11]:
n1 = dados [selecao].shape[0]

In [12]:
n1

19532

In [13]:
n1

19532

In [14]:
#Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
selecao = (dados['Tipo'] == 'Casa')| (dados['Tipo'] =='Casa de Condomínio') |(dados['Tipo'] =='Casa de Vila')
n2=dados[selecao].shape[0]
n2

2212

In [15]:
#Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
selecao=(dados['Area'] >=60) & (dados['Area'] <=100)
n3 = dados[selecao].shape[0]
n3

8719

In [16]:
#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.
selecao=(dados['Quartos'] >=4) & (dados['Valor'] <2000)
n4 = dados[selecao].shape[0]
n4

41

In [17]:
print(" 'Apartamento' -> {}" .format(n1)) 

print(" 'Casa', 'Casa de Condomínio' e 'Casa de Vila'-> {}" .format(n2)) 

print(" área entre 60 e 100 metros quadrados -> {}" .format(n3)) 

print(" 4 quartos e aluguel menor que R$ 2.000,00-> {}" .format(n4))

 'Apartamento' -> 19532
 'Casa', 'Casa de Condomínio' e 'Casa de Vila'-> 2212
 área entre 60 e 100 metros quadrados -> 8719
 4 quartos e aluguel menor que R$ 2.000,00-> 41

In [18]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [19]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [20]:
selecao = alunos['Aprovado'] == True
aprovados = alunos [selecao]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [21]:
selecao = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
MeninasAprovadas = alunos [selecao]
MeninasAprovadas

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [22]:
selecao = ((alunos.Idade > 10) &  (alunos.Idade < 20)) | (alunos.Idade >= 40)
alunos[selecao]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False